---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ElectricalTemperatureDifference
source: html/c23aa243-772c-235f-6e28-9b64646b8e68.htm
---
# Autodesk.Revit.DB.SpecTypeId.ElectricalTemperatureDifference Property

Temperature Difference, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId ElectricalTemperatureDifference { get; }
```